app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    if params["event"]["payload"]
      @event.payload = params["event"]["payload"].to_json
    end

    if params["event"]["timestamp"]
      @event.timestamp = Time.at(params["event"]["timestamp"])
    end

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("type", "uuid", "user", "app", "payload", "timestamp", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_event
      @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 6]]